eddiehesketh/two-stage-sorting-system-stm32/two-stage-sorting-system-stm32/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE for Visual Studio Code Extension
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include <stdint.h>
#include "reset_and_control_clock.h"
#include "interrupt.h"
#include "gpio.h"
#include "stm32c031xx.h"
#include "assignment_1.h"
#include "timer.h"
#include "pwm.h"

#define SERVO_MIN_US 500 // 1.0 ms = ~0 degrees
#define SERVO_MID_US 1500 // 1.5 ms = ~90 degrees
#define SERVO_MAX_US 2500

static volatile uint16_t duty = 500;
static volatile uint16_t del_t = 11;


void initialise_inputs() {
    init_pin(GPIOA, 2, MODE_INPUT, PULL_DOWN); // new item PA2
    init_pin(GPIOA, 10, MODE_INPUT, PULL_DOWN); // step gate PA10
    init_pin(GPIOB, 5, MODE_INPUT, PULL_DOWN); // E-stop PB5
}

void initialise_pwm() {
    init_pin(GPIOC, 7, MODE_ALT, NONE);
    init_pin(GPIOB, 0, MODE_ALT, NONE);
}

void initialise_outputs() {
    init_pin(GPIOA, 9, MODE_OUTPUT, NONE); // status LED

    init_pin(GPIOA, 0, MODE_OUTPUT, NONE); // real colour: RGB LED -> red
    init_pin(GPIOB, 1, MODE_OUTPUT, NONE); // real colour: RGB LED -> green
    init_pin(GPIOA, 4, MODE_OUTPUT, NONE); // real colour: RGB LED -> blue

    init_pin(GPIOA, 3, MODE_OUTPUT, NONE); // sensed colour: RGB LED -> red 
    init_pin(GPIOB, 11, MODE_OUTPUT, NONE); // sensed colour: RGB LED -> green 
    init_pin(GPIOA, 8, MODE_OUTPUT, NONE); // sensed colour: RGB LED -> blue 
}


int main(void)
{
    SysTick_Init();
    enable_port_clock(A);
    enable_port_clock(B);
    enable_port_clock(C);
    initialise_inputs();
    initialise_pwm();
    initialise_outputs();

    enable_interrupt(A, RISING, 2, 1);


    // init_pin(GPIOA, 2, MODE_INPUT, PULL_DOWN);
    // init_pin(GPIOA, 9, MODE_OUTPUT, NONE);
    // init_pin(GPIOA, 5, MODE_OUTPUT, NONE);

    // enable_port_clock(C);
    // init_pin(GPIOC, 7, MODE_ALT, NONE);
    // enable_cap_com(GPIOC, 7, 2, 1, 500, 19999, 47);


    // enable_interrupt(A, BOTH, 2, 1);
    // // enable_interrupt(A, FALLING, 2, 2);

    // enable_timer(TIM16, 65534, 5000,2);

    /* Loop forever */
	while (1) {

    }
}

void EXTI2_3_IRQHandler() {
    if (EXTI->RPR1 & (1 << 2)) {
        EXTI->RPR1 |= (1 << 2);
        Generate_Next_Item();
    } 
}

// void EXTI2_3_IRQHandler() {
//     if (EXTI->RPR1 & (1 << 2)) {
//         EXTI->RPR1 |= (1 << 2);
//         toggle_output(GPIOA, 9);
//     } else if (EXTI->FPR1 & (1 << 2)) {
//         EXTI->FPR1 |= (1 << 2);
//         toggle_output(GPIOA, 9);
//     }
// }

// void TIM3_IRQHandler() {
//     if (TIM3->SR & (1 << 0)) {
//         TIM3->SR &= ~(1 << 0);
//         duty += del_t;
//         if (duty >= SERVO_MAX_US || duty <= SERVO_MIN_US) { 
//             del_t = -del_t;
//         }
//        TIM3->CCR2 = duty;
//     }
// }

// void TIM16_IRQHandler() {
//     if (TIM16->SR & (1 << 0)) {
//         TIM16->SR &= ~(1 << 0);
//         toggle_output(GPIOA, 5);
//     }
// }
